{"id":1102,"date":"2015-03-03T09:01:43","date_gmt":"2015-03-03T02:01:43","guid":{"rendered":"http:\/\/vmblogs.vn\/?p=1102"},"modified":"2015-03-03T09:01:43","modified_gmt":"2015-03-03T02:01:43","slug":"raspberry-pi-2-model-b-thin-client","status":"publish","type":"post","link":"http:\/\/vmblogs.vn\/raspberry-pi-2-model-b-thin-client\/","title":{"rendered":"Raspberry Pi 2 Model B &#8211; Thin client"},"content":{"rendered":"<p><span style=\"color: #0000ff;\"><strong>Raspberry Pi 2 Model B &#8211; Thin client<\/strong><\/span><\/p>\n<p>V\u1ec1 c\u00e1ch th\u1ee9c s\u1eed d\u1ee5ng nh\u01b0 thinclient m\u00ecnh quay phim \u0111\u1ec3 c\u00e1c b\u1ea1n d\u1ec5 h\u00ecnh dung. Nh\u00ecn chung hi\u1ec7u n\u0103ng hi\u1ec3n th\u1ecb t\u1ed1t k\u1ec3 c\u1ea3 trong t\u00ecnh hu\u1ed1ng remote desktop v\u00e0 s\u1eed d\u1ee5ng Citrix Receiver k\u1ebft n\u1ed1i \u0111\u1ebfn XenApp farm. Mu\u1ed1n t\u00ecm hi\u1ec3u XenApp c\u00e1c b\u1ea1n c\u00f3 th\u1ec3 tham kh\u1ea3o ch\u1eef k\u00fd c\u1ee7a m\u00ecnh<\/p>\n<p><span style=\"text-decoration: underline;\">Remote desktop<\/span><\/p>\n<p><iframe loading=\"lazy\" width=\"780\" height=\"439\" src=\"https:\/\/www.youtube.com\/embed\/wVt0Z73cOYM?feature=oembed\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<p>Remote Desktop ch\u1ea1y t\u1ed1t tuy nhi\u00ean c\u00f3 ph\u1ea7n xem video kh\u00f4ng \u0111\u01b0\u1ee3c m\u01b0\u1ee3t v\u00e0 khung h\u00ecnh kh\u00f4ng \u0111\u1ed3ng b\u1ed9. \u0110\u00e2y l\u00e0 \u0111i\u1ec3m chung c\u1ee7a Remote desktop kh\u00f4ng th\u1ec3 tr\u00e1nh kh\u1ecfi. Ngo\u00e0i ra remote desktop ch\u1ec9 l\u00e0m vi\u1ec7c v\u1edbi c\u00e1c \u1ee9ng d\u1ee5ng d\u1ef1ng h\u00ecnh b\u1eb1ng DirectX, do \u0111\u00f3 c\u00e1c \u1ee9ng d\u1ee5ng d\u1ef1ng h\u00ecnh OpenGL s\u1ebd kh\u00f4ng ch\u1ea1y \u0111\u01b0\u1ee3c.<\/p>\n<p><span style=\"text-decoration: underline;\">Citrix Receiver client<\/span><\/p>\n<p><iframe loading=\"lazy\" width=\"780\" height=\"439\" src=\"https:\/\/www.youtube.com\/embed\/ky8DNoJRZVU?feature=oembed\" frameborder=\"0\" allowfullscreen><\/iframe><\/p>\n<p>V\u1ec1 Citrix Receiver k\u1ebft n\u1ed1i \u0111\u1ebfn XenApp server, c\u00e1ch th\u1ee9c ho\u1ea1t \u0111\u1ed9ng t\u01b0\u01a1ng t\u1ef1 Remote desktop tuy nhi\u00ean v\u1eadn h\u00e0nh t\u1ed1t h\u01a1n r\u1ea5t nhi\u1ec1u so v\u1edbi remote desktop. C\u00f4ng ngh\u1ec7 Citrix HDX cho ph\u00e9p x\u1eed l\u00fd khung \u1ea3nh t\u1ed1t h\u01a1n v\u00e0 ch\u1ebf \u0111\u1ed9 n\u00e9n cao h\u01a1n do \u0111\u00f3 xem video r\u1ea5t m\u01b0\u1ee3t, kh\u00f4ng c\u00f3 hi\u1ec7n t\u01b0\u1ee3ng tr\u00f4i khung h\u00ecnh.<\/p>\n<p>Ngo\u00e0i ra th\u00ec Citrix HDX h\u1ed7 tr\u1ee3 c\u00e1c \u1ee9ng d\u1ee5ng \u0111\u1ed3 h\u1ecda OpenGL, m\u1ed9t \u0111i\u1ec3m v\u01b0\u1ee3t tr\u1ed9i so v\u1edbi Remote Desktop. Trong video m\u00ecnh c\u0169ng demo m\u1ed9t v\u00e0i \u1ee9ng d\u1ee5ng \u0111\u1ed3 h\u1ecda s\u1eed d\u1ee5ng OpenGL<\/p>\n<p>K\u1ebft lu\u1eadn c\u1ee7a ph\u1ea7n n\u00e0y nh\u00ecn chung m\u00ecnh \u0111\u00e1nh gi\u00e1 cao kh\u1ea3 n\u0103ng ho\u1ea1t \u0111\u1ed9ng c\u1ee7a Pi2, so s\u00e1nh v\u1edbi con Rockchip RK3188 quad-core 1.5GHz c\u1ee7a m\u00ecnh th\u00ec c\u00f3 th\u1ec3 n\u00f3i ko h\u1ec1 thua k\u00e9m.<\/p>\n<p>B\u00e0i vi\u1ebft s\u1eed d\u1ee5ng RPiTC (Raspberry Thin client) \u0111\u01b0\u1ee3c ph\u00e1t tri\u1ec3n b\u1edfi rpitc.blogspot.com<\/p>\n","protected":false},"excerpt":{"rendered":"<p>Raspberry Pi 2 Model B &#8211; Thin client V\u1ec1 c\u00e1ch th\u1ee9c s\u1eed d\u1ee5ng nh\u01b0 thinclient m\u00ecnh quay phim \u0111\u1ec3 c\u00e1c b\u1ea1n d\u1ec5 h\u00ecnh dung. Nh\u00ecn chung hi\u1ec7u n\u0103ng hi\u1ec3n th\u1ecb t\u1ed1t k\u1ec3 c\u1ea3 trong t\u00ecnh hu\u1ed1ng remote desktop v\u00e0 s\u1eed d\u1ee5ng Citrix Receiver k\u1ebft n\u1ed1i \u0111\u1ebfn XenApp farm. Mu\u1ed1n t\u00ecm hi\u1ec3u XenApp c\u00e1c b\u1ea1n c\u00f3 <a class=\"more-link\" href=\"http:\/\/vmblogs.vn\/raspberry-pi-2-model-b-thin-client\/\">Read More &#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":1094,"comment_status":"open","ping_status":"open","sticky":false,"template":"","format":"standard","meta":[],"categories":[22],"tags":[159,162],"_links":{"self":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts\/1102"}],"collection":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/comments?post=1102"}],"version-history":[{"count":0,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts\/1102\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/media\/1094"}],"wp:attachment":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/media?parent=1102"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/categories?post=1102"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/tags?post=1102"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}