{"id":774,"date":"2014-12-18T11:54:46","date_gmt":"2014-12-18T04:54:46","guid":{"rendered":"http:\/\/vmblogs.vn\/?p=774"},"modified":"2014-12-30T15:13:48","modified_gmt":"2014-12-30T08:13:48","slug":"bao-mat-vps-linux","status":"publish","type":"post","link":"http:\/\/vmblogs.vn\/bao-mat-vps-linux\/","title":{"rendered":"B\u1ea3o m\u1eadt VPS Linux"},"content":{"rendered":"<p>B\u1ea3o m\u1eadt VPS Linux<\/p>\n<p>Ch\u00e0o c\u00e1c b\u1ea1n, hi\u1ec7n nay r\u1ea5t nhi\u1ec1u c\u00f4ng ty cung c\u1ea5p cloud server gi\u00e1 th\u00e0nh r\u1ea5t r\u1ebb nh\u01b0 Linode, Digital Ocean, Rackspace&#8230;tuy nhi\u00ean c\u00f3 m\u1ed9t tr\u1edf ng\u1ea1i v\u1edbi m\u1ecdi ng\u01b0\u1eddi l\u00e0 h\u1ea7u h\u1ebft c\u00e1c vps n\u00e0y \u0111\u1ec1u ch\u1ea1y Linux (CentOS l\u00e0 ch\u00ednh).<\/p>\n<p>Theo nhi\u1ec1u \u0111\u00e1nh gi\u00e1 th\u00ec VPS ch\u1ea1y t\u1ed1t v\u00e0 \u1ed5n \u0111\u1ecbnh h\u01a1n so v\u1edbi s\u1eed d\u1ee5ng host share khi m\u1ed9t server \u0111\u01b0\u1ee3c ch\u1ea1y cho r\u1ea5t, r\u1ea5t nhi\u1ec1u website. T\u1ea5t nhi\u00ean l\u00e0 website c\u1ee7a b\u1ea1n ch\u1ea1y 1 m\u00ecnh s\u1ebd t\u1ed1t h\u01a1n l\u00e0 chung ch\u1ea1 v\u1edbi nhi\u1ec1u ng\u01b0\u1eddi kh\u00e1c.<\/p>\n<p>\u0110\u1ec3 l\u00e0m vi\u1ec7c v\u1edbi VPS Linux th\u00ec t\u1ea5t nhi\u00ean b\u1ea1n ph\u1ea3i t\u1ef1 trang b\u1ecb cho m\u00ecnh m\u1ed9t s\u1ed1 ki\u1ebfn th\u1ee9c nh\u1ea5t \u0111\u1ecbnh \u0111\u1ec3 c\u00f3 th\u1ec3 l\u00e0m ch\u1ee7 \u0111\u01b0\u1ee3c nh\u1eefng g\u00ec m\u00ecnh mua. Vi\u1ec7c c\u1ea5u h\u00ecnh vps linux hi\u1ec7n c\u00f3 r\u1ea5t nhi\u1ec1u h\u01b0\u1edbng d\u1eabn tr\u00ean m\u1ea1ng, ch\u1ec9 c\u1ea7n Google 1 ch\u00fat l\u00e0 ra r\u1ea5t nhi\u1ec1u h\u01b0\u1edbng d\u1eabn n\u00ean m\u00ecnh c\u0169ng kh\u00f4ng n\u00f3i th\u00eam. Trong b\u00e0i post n\u00e0y m\u00ecnh ch\u1ee7 y\u1ebfu t\u1eadp trung \u0111\u1ebfn v\u1ea5n \u0111\u1ec1 m\u00e0 m\u1ecdi ng\u01b0\u1eddi c\u1ef1c k\u1ef3 quan t\u00e2m &#8211; b\u1ea3o m\u1eadt.<\/p>\n<p>N\u00f3i v\u1ec1 b\u1ea3o m\u1eadt l\u00e0 n\u00f3i v\u1ec1 m\u1ed9t ch\u1ee7 \u0111\u1ec1 r\u1ed9ng l\u1edbn, nh\u1eefng g\u00ec \u0111\u01b0\u1ee3c post \u1edf \u0111\u00e2y c\u0169ng ch\u1ec9 l\u00e0 nh\u1ecf nhoi. Tuy nhi\u00ean n\u00f3 c\u0169ng ph\u1ea7n n\u00e0o gi\u00fap b\u1ea1n gi\u1ea3m b\u1edbt \u0111\u01b0\u1ee3c nguy c\u01a1 t\u1ea5n c\u00f4ng. M\u00ecnh quan ni\u1ec7m th\u1ebf n\u00e0y, server c\u1ee7a b\u1ea1n ch\u01b0a b\u1ecb hack ch\u1ec9 c\u00f3 th\u1ec3 do b\u1ea1n may m\u1eafn ch\u01b0a b\u1ecb hacker nh\u00f2m ng\u00f3 m\u00e0 th\u00f4i, tuy nhi\u00ean kh\u00f4ng v\u00ec v\u1eady m\u00e0 kh\u00f4ng c\u1ea7n quan t\u00e2m \u0111\u1ebfn b\u1ea3o m\u1eadt.<\/p>\n<ul>\n<li><a title=\"B\u1ea3o m\u1eadt SSH\" href=\"http:\/\/vmblogs.vn\/bao-mat-ssh\/\" target=\"_blank\">B\u1ea3o m\u1eadt SSH<\/a><\/li>\n<li><a title=\"B\u1ea3o m\u1eadt t\u01b0\u1eddng l\u1eeda v\u1edbi Advanced Policy Firewall\" href=\"http:\/\/vmblogs.vn\/bao-mat-tuong-lua-voi-apf\/\" target=\"_blank\">B\u1ea3o m\u1eadt t\u01b0\u1eddng l\u1eeda v\u1edbi APF (Advanced Policy Firewall)<\/a><\/li>\n<li><a title=\"Block brute-force attach with BFD\" href=\"http:\/\/vmblogs.vn\/chong-tan-cong-brute-force-voi-bfd\/\" target=\"_blank\">Ch\u1ed1ng t\u1ea5n c\u00f4ng brute-force v\u1edbi BFD (Brute Force Detection)<\/a><\/li>\n<li><a title=\"Block virus with ClamAV\" href=\"http:\/\/vmblogs.vn\/cai-dat-clamav-antivirus-cho-centos\/\" target=\"_blank\">Ph\u00f2ng ng\u1eeba virus v\u1edbi ClamAV<\/a><\/li>\n<li><a title=\"Block rootkit with RKHunter\" href=\"http:\/\/vmblogs.vn\/cai-dat-rkhunter-diet-rootkit-cho-centos\/\" target=\"_blank\">Ph\u00f2ng ng\u1eeba rootkit v\u1edbi RKHunter<\/a><\/li>\n<li>Ph\u00f2ng ng\u1eeba t\u1ea5n c\u00f4ng v\u1edbi Snort<\/li>\n<\/ul>\n","protected":false},"excerpt":{"rendered":"<p>B\u1ea3o m\u1eadt VPS Linux Ch\u00e0o c\u00e1c b\u1ea1n, hi\u1ec7n nay r\u1ea5t nhi\u1ec1u c\u00f4ng ty cung c\u1ea5p cloud server gi\u00e1 th\u00e0nh r\u1ea5t r\u1ebb nh\u01b0 Linode, Digital Ocean, Rackspace&#8230;tuy nhi\u00ean c\u00f3 m\u1ed9t tr\u1edf ng\u1ea1i v\u1edbi m\u1ecdi ng\u01b0\u1eddi l\u00e0 h\u1ea7u h\u1ebft c\u00e1c vps n\u00e0y \u0111\u1ec1u ch\u1ea1y Linux (CentOS l\u00e0 ch\u00ednh). Theo nhi\u1ec1u \u0111\u00e1nh gi\u00e1 th\u00ec VPS ch\u1ea1y t\u1ed1t v\u00e0 <a class=\"more-link\" href=\"http:\/\/vmblogs.vn\/bao-mat-vps-linux\/\">Read More &#8230;<\/a><\/p>\n","protected":false},"author":1,"featured_media":775,"comment_status":"open","ping_status":"open","sticky":true,"template":"","format":"standard","meta":[],"categories":[116],"tags":[115,128,96],"_links":{"self":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts\/774"}],"collection":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts"}],"about":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/types\/post"}],"author":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/users\/1"}],"replies":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/comments?post=774"}],"version-history":[{"count":0,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/posts\/774\/revisions"}],"wp:featuredmedia":[{"embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/media\/775"}],"wp:attachment":[{"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/media?parent=774"}],"wp:term":[{"taxonomy":"category","embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/categories?post=774"},{"taxonomy":"post_tag","embeddable":true,"href":"http:\/\/vmblogs.vn\/wp-json\/wp\/v2\/tags?post=774"}],"curies":[{"name":"wp","href":"https:\/\/api.w.org\/{rel}","templated":true}]}}